In [1]:
%load_ext sql

In [2]:
##changing password here to protect my own
%sql mysql://root:<password>@localhost/country_club

'Connected: root@country_club'

### Q1: Some of the facilities charge a fee to members, but some do not. Please list the names of the facilities that do.

In [3]:
%%sql 

SELECT name AS 'Paid_Facilities' 
FROM Facilities 
WHERE membercost != 0.0

 * mysql://root:***@localhost/country_club
5 rows affected.

[('Tennis Court 1',),
 ('Tennis Court 2',),
 ('Massage Room 1',),
 ('Massage Room 2',),
 ('Squash Court',)]

### Q2: How many facilities do not charge a fee to members?

In [4]:
%%sql 

SELECT COUNT(name) AS 'Free_for_Members_Facilities' 
FROM Facilities 
WHERE membercost = 0.0

 * mysql://root:***@localhost/country_club
1 rows affected.

[(4,)]

### Q3: How can you produce a list of facilities that charge a fee to members, where the fee is less than 20% of the facility's monthly maintenance cost?
Return the facid, facility name, member cost, and monthly maintenance of the
facilities in question.

In [5]:
%%sql 

SELECT facid, name, membercost, monthlymaintenance 
FROM Facilities 
WHERE membercost > 0 AND membercost < (0.2 * monthlymaintenance)

 * mysql://root:***@localhost/country_club
5 rows affected.

[(0, 'Tennis Court 1', Decimal('5.0'), 200),
 (1, 'Tennis Court 2', Decimal('5.0'), 200),
 (4, 'Massage Room 1', Decimal('9.9'), 3000),
 (5, 'Massage Room 2', Decimal('9.9'), 3000),
 (6, 'Squash Court', Decimal('3.5'), 80)]

### Q4: How can you retrieve the details of facilities with ID 1 and 5?
Write the query without using the OR operator.

In [6]:
%%sql 

SELECT * 
FROM Facilities 
WHERE facid IN (1,5)

 * mysql://root:***@localhost/country_club
2 rows affected.

[(1, 'Tennis Court 2', Decimal('5.0'), Decimal('25.0'), 8000, 200),
 (5, 'Massage Room 2', Decimal('9.9'), Decimal('80.0'), 4000, 3000)]

### Q5: How can you produce a list of facilities, with each labelled as 'cheap' or 'expensive', depending on if their monthly maintenance cost is more than 100? 
Return the name and monthly maintenance of the facilities in question.

In [7]:
%%sql 

SELECT name, monthlymaintenance, 
CASE WHEN monthlymaintenance > 100 THEN 'expensive' ELSE 'cheap' END AS 'cost_category' 
FROM Facilities

 * mysql://root:***@localhost/country_club
9 rows affected.

[('Tennis Court 1', 200, 'expensive'),
 ('Tennis Court 2', 200, 'expensive'),
 ('Badminton Court', 50, 'cheap'),
 ('Table Tennis', 10, 'cheap'),
 ('Massage Room 1', 3000, 'expensive'),
 ('Massage Room 2', 3000, 'expensive'),
 ('Squash Court', 80, 'cheap'),
 ('Snooker Table', 15, 'cheap'),
 ('Pool Table', 15, 'cheap')]

### Q6: You'd like to get the first and last name of the last member(s) who signed up.
Do not use the LIMIT clause for your solution.

In [8]:
%%sql 

SELECT firstname, surname 
FROM Members 
WHERE joindate = (SELECT MAX(joindate) FROM Members)

 * mysql://root:***@localhost/country_club
1 rows affected.

[('Darren', 'Smith')]

### Q7: How can you produce a list of all members who have used a tennis court?
Include in your output the name of the court, and the name of the member formatted as a single column. Ensure no duplicate data, and order by the member name.

In [9]:
%%sql

SELECT DISTINCT CONCAT(mem.surname,',',mem.firstname) AS 'member_name', fac.name 
FROM Members mem JOIN Bookings book ON mem.memid = book.memid 
JOIN Facilities fac ON book.facid = fac.facid 
WHERE fac.name LIKE "Tennis Court _" 
ORDER BY 1,2

 * mysql://root:***@localhost/country_club
46 rows affected.

[('Bader,Florence', 'Tennis Court 1'),
 ('Bader,Florence', 'Tennis Court 2'),
 ('Baker,Anne', 'Tennis Court 1'),
 ('Baker,Anne', 'Tennis Court 2'),
 ('Baker,Timothy', 'Tennis Court 1'),
 ('Baker,Timothy', 'Tennis Court 2'),
 ('Boothe,Tim', 'Tennis Court 1'),
 ('Boothe,Tim', 'Tennis Court 2'),
 ('Butters,Gerald', 'Tennis Court 1'),
 ('Butters,Gerald', 'Tennis Court 2'),
 ('Coplin,Joan', 'Tennis Court 1'),
 ('Crumpet,Erica', 'Tennis Court 1'),
 ('Dare,Nancy', 'Tennis Court 1'),
 ('Dare,Nancy', 'Tennis Court 2'),
 ('Farrell,David', 'Tennis Court 1'),
 ('Farrell,David', 'Tennis Court 2'),
 ('Farrell,Jemima', 'Tennis Court 1'),
 ('Farrell,Jemima', 'Tennis Court 2'),
 ('Genting,Matthew', 'Tennis Court 1'),
 ('GUEST,GUEST', 'Tennis Court 1'),
 ('GUEST,GUEST', 'Tennis Court 2'),
 ('Hunt,John', 'Tennis Court 1'),
 ('Hunt,John', 'Tennis Court 2'),
 ('Jones,David', 'Tennis Court 1'),
 ('Jones,David', 'Tennis Court 2'),
 ('Jones,Douglas', 'Tennis Court 1'),
 ('Joplette,Janice', 'Tennis Court 1'),
 ('Joplette,Janice', 'Tennis Court 2'),
 ('Owen,Charles', 'Tennis Court 1'),
 ('Owen,Charles', 'Tennis Court 2'),
 ('Pinker,David', 'Tennis Court 1'),
 ('Purview,Millicent', 'Tennis Court 2'),
 ('Rownam,Tim', 'Tennis Court 1'),
 ('Rownam,Tim', 'Tennis Court 2'),
 ('Rumney,Henrietta', 'Tennis Court 2'),
 ('Sarwin,Ramnaresh', 'Tennis Court 1'),
 ('Sarwin,Ramnaresh', 'Tennis Court 2'),
 ('Smith,Darren', 'Tennis Court 2'),
 ('Smith,Jack', 'Tennis Court 1'),
 ('Smith,Jack', 'Tennis Court 2'),
 ('Smith,Tracy', 'Tennis Court 1'),
 ('Smith,Tracy', 'Tennis Court 2'),
 ('Stibbons,Ponder', 'Tennis Court 1'),
 ('Stibbons,Ponder', 'Tennis Court 2'),
 ('Tracy,Burton', 'Tennis Court 1'),
 ('Tracy,Burton', 'Tennis Court 2')]

### Q8: How can you produce a list of bookings on the day of 2012-09-14 which will cost the member (or guest) more than 30? 
Remember that guests have different costs to members (the listed costs are per half-hour 'slot'), and the guest user's ID is always 0. Include in your output the name of the facility, the name of the member formatted as a single column, and the cost. Order by descending cost, and do not use any subqueries.

In [10]:
%%sql 

SELECT fac.name AS facility_name,
CONCAT(mem.surname,',',mem.firstname) AS member_name,
CASE WHEN book.memid != 0 THEN (fac.membercost * book.slots)
ELSE (fac.guestcost * book.slots) END AS booking_cost
FROM Bookings book JOIN Facilities fac ON book.facid = fac.facid
JOIN Members mem ON book.memid = mem.memid
WHERE starttime LIKE '2012-09-14%'
AND ((book.memid = 0 and fac.guestcost * book.slots > 30) or
(book.memid != 0 and fac.membercost * book.slots > 30))
ORDER BY booking_cost DESC

 * mysql://root:***@localhost/country_club
12 rows affected.

[('Massage Room 2', 'GUEST,GUEST', Decimal('320.0')),
 ('Massage Room 1', 'GUEST,GUEST', Decimal('160.0')),
 ('Massage Room 1', 'GUEST,GUEST', Decimal('160.0')),
 ('Massage Room 1', 'GUEST,GUEST', Decimal('160.0')),
 ('Tennis Court 2', 'GUEST,GUEST', Decimal('150.0')),
 ('Tennis Court 1', 'GUEST,GUEST', Decimal('75.0')),
 ('Tennis Court 1', 'GUEST,GUEST', Decimal('75.0')),
 ('Tennis Court 2', 'GUEST,GUEST', Decimal('75.0')),
 ('Squash Court', 'GUEST,GUEST', Decimal('70.0')),
 ('Massage Room 1', 'Farrell,Jemima', Decimal('39.6')),
 ('Squash Court', 'GUEST,GUEST', Decimal('35.0')),
 ('Squash Court', 'GUEST,GUEST', Decimal('35.0'))]

### Q9: This time, produce the same result as in Q8, but using a subquery.

In [11]:
%%sql 

SELECT facility_name, member_name, booking_cost 
    FROM (SELECT fac.name AS facility_name,
        CONCAT(mem.surname,',',mem.firstname) AS member_name,
        CASE WHEN book.memid != 0 THEN (fac.membercost * book.slots)
        ELSE (fac.guestcost * book.slots) END AS booking_cost
        FROM Bookings book JOIN Facilities fac ON book.facid = fac.facid
        JOIN Members mem ON book.memid = mem.memid
        WHERE starttime LIKE '2012-09-14%') 
    AS bookings
WHERE booking_cost > 30
ORDER BY booking_cost DESC

 * mysql://root:***@localhost/country_club
12 rows affected.

[('Massage Room 2', 'GUEST,GUEST', Decimal('320.0')),
 ('Massage Room 1', 'GUEST,GUEST', Decimal('160.0')),
 ('Massage Room 1', 'GUEST,GUEST', Decimal('160.0')),
 ('Massage Room 1', 'GUEST,GUEST', Decimal('160.0')),
 ('Tennis Court 2', 'GUEST,GUEST', Decimal('150.0')),
 ('Tennis Court 1', 'GUEST,GUEST', Decimal('75.0')),
 ('Tennis Court 1', 'GUEST,GUEST', Decimal('75.0')),
 ('Tennis Court 2', 'GUEST,GUEST', Decimal('75.0')),
 ('Squash Court', 'GUEST,GUEST', Decimal('70.0')),
 ('Massage Room 1', 'Farrell,Jemima', Decimal('39.6')),
 ('Squash Court', 'GUEST,GUEST', Decimal('35.0')),
 ('Squash Court', 'GUEST,GUEST', Decimal('35.0'))]

### Q10: Produce a list of facilities with a total revenue less than 1000.
The output of facility name and total revenue, sorted by revenue. Remember
that there's a different cost for guests and members!

In [12]:
%%sql 

SELECT facility_name, total_revenue
    FROM (SELECT fac.name AS facility_name,
        SUM(CASE WHEN book.memid != 0 THEN (fac.membercost * book.slots)
        ELSE (fac.guestcost * book.slots) END) AS total_revenue
        FROM Bookings book JOIN Facilities fac ON book.facid = fac.facid
        GROUP BY fac.name) 
    AS bookings WHERE total_revenue < 1000
ORDER BY total_revenue

 * mysql://root:***@localhost/country_club
3 rows affected.

[('Table Tennis', Decimal('180.0')),
 ('Snooker Table', Decimal('240.0')),
 ('Pool Table', Decimal('270.0'))]